(ns srpski-jezik-lib.glasovne-promene-test
  (:require [clojure.test :refer :all]
            [srpski-jezik-lib.glasovne-promene :refer :all]))

(deftest test-glasovnih-promena
  (testing
   (let [testni-podaci  [["борац" "а" "борца" "бораца" nepostojano-a]
                         ["добар" "о" "добро" "добаро" nepostojano-a]
                         ["један" "ог" "једног" "једаног" nepostojano-a]
                         ["чачак" "а" "чачка" "чачака" nepostojano-a]
                         ["писал" "" "писао" "писал" prelazak-l-u-o]
                         ["дал" "" "дао" "дал" prelazak-l-u-o]
                         ["селба" "" "сеоба" "селба" prelazak-l-u-o]
                         ["читалац" "" "читалац" "читаоц" prelazak-l-u-o]
                         ["тужилац" "" "тужилац" "тужиоц" prelazak-l-u-o]
                         ["глод" "јем" "глођем" "глодјем" jotovanje]
                         ["трн" "је" "трње" "трнје" jotovanje]
                         ["брз" "ји" "бржи" "брзји" jotovanje]
                         ["сноп" "је" "снопље" "снопје" jotovanje]
                         ["здрав" "је" "здравље" "здравје" jotovanje]
                         ["рус" "ски" "руски" "русски" gubljenje-suglasnika]
                         ["без" "звучни" "безвучни" "беззвучни" gubljenje-suglasnika]
                         ["мест" "ни" "месни" "местни" gubljenje-suglasnika]
                         ["изузет" "ци" "изузеци" "изузетци" gubljenje-suglasnika]
                          ; почетак изузетака губљења сугласника
                         ["нај" "јачи" "најјачи" "најачи" gubljenje-suglasnika]
                         ["нај" "једноставнији" "најједноставнији" "наједноставнији" gubljenje-suglasnika]
                         ["над" "друштвени" "наддруштвени" "надруштвени" gubljenje-suglasnika]
                         ["под" "дијалекат" "поддијалекат" "подијалекат" gubljenje-suglasnika]
                         ["фашист" "киња" "фашисткиња" "фашискиња" gubljenje-suglasnika]
                          ; крај изузетака губљења сугласника
                         ["друг" "ина" "дружина" "другина" palatalizacija-i-a]
                         ["јунак" "е" "јуначе" "јунаке" palatalizacija-i-a]
                         ["прах" "ина" "прашина" "прахина" palatalizacija-i-a]
                         ["прах" "ак" "прашак" "прахак" palatalizacija-i-a]
                          ; почетак изузетака палатализавије један под а
                         ["десанк" "ин" "десанкин" "десанчин" palatalizacija-i-a]
                         ["милк" "ин" "милкин" "милчин" palatalizacija-i-a]
                         ["олг" "ин" "олгин" "олжин" palatalizacija-i-a]
                         ["мех" "ин" "мехин" "мешин" palatalizacija-i-a]
                          ; крај изузетака палатализавије један под а
                         ["кнез" "е" "кнеже" "кнезе" palatalizacija-i-b]
                         ["милиц" "ин" "миличин" "милицин" palatalizacija-i-b]
                         ["мајк" "и" "мајци" "мајки" palatalizacija-ii]
                         ["јаруг" "и" "јарузи" "јаруги" palatalizacija-ii]
                         ["снах" "и" "снаси" "снахи" palatalizacija-ii]
                          ; почетак изузетака палатализавије два
                         ["десанк" "и" "десанки" "десанци" palatalizacija-ii]
                         ["милк" "и" "милки" "милци" palatalizacija-ii]
                         ["олг" "и" "олги" "олжи" palatalizacija-ii]
                         ["пожег" "и" "пожеги" "" palatalizacija-ii]
                         ["пожег" "и" "пожези" "" palatalizacija-ii]
                         ["лик" "и" "лики" "" palatalizacija-ii]
                         ["лик" "и" "лици" "" palatalizacija-ii]
                         ["сек" "и" "секи" "сеци" palatalizacija-ii]
                         ["бак" "и" "баки" "баци" palatalizacija-ii]
                          ; крај изузетака палатализавије два
                         ["паз" "ња" "пажња" "пазња" jspmt-a]
                         ["нос" "ња" "ношња" "носња" jspmt-a]
                         ["сналаз" "љив" "сналажљив" "сналазљив" jspmt-a]
                          ; почетак изузетака јспмт под а
                         ["из" "љубити" "изљубити" "ижљубити" jspmt-a]
                         ["раз" "љутити" "разљутити" "ражљутити" jspmt-a]
                          ; крај изузетака јспмт под а
                         ["одбран" "бени" "одбрамбени" "одбранбени" jspmt-b]
                         ["стан" "бени" "стамбени" "станбени" jspmt-b]
                          ; почетак изузетака јспмт под б
                         ["један" "пут" "једанпут" "једампут" jspmt-b]
                          ; крај изузетака јспмт под б
                         ["враб" "ца" "врапца" "врабца" jspz]
                         ["срб" "ски" "српски" "србски" jspz]
                         ["сват" "ба" "свадба" "сватба" jspz]
                         ["рент" "ген" "рендген" "рентген" jspz]
                          ; почетак изузетака јспз
                         ["пред" "седник" "председник" "претседник" jspz]
                         ["пред" "школско" "предшколско" "претшколско" jspz]
                         ["од" "суство" "одсуство" "отсуство" jspz]
                         ["под" "шишати" "подшишати" "потшишати" jspz]
                         ["Вашинг" "тон" "Вашингтон" "Вашинктон" jspz]
                         ["Рент" "ген" "Рентген" "Рендген" jspz]
                         ["драг" "стор" "драгстор" "дракстор" jspz]
                         ["лонг" "плеј" "лонгплеј" "лонкплеј" jspz]
                         ["нок" "даун" "нокдаун" "ногдаун" jspz]
                         ["штајк" "брехер" "штрајкбрехер" "штрајгбрехер" jspz]
                          ; крај изузетака јспз
                         ]]
    (doseq [[rec nastavak
             ispravno neispravno
             glasovna-promena-fn] testni-podaci]
     (is (= (glasovna-promena-fn rec nastavak)
            ispravno))
     (is (not (= (glasovna-promena-fn rec nastavak)
                 neispravno))
      ))
    ))
  )

(deftest test-glasovnih-promena
  (testing
   (let [testni-podaci  [["борац" "а" "борца" "бораца"]
                         ["добар" "о" "добро" "добаро"]
                         ["један" "ог" "једног" "једаног"]
                         ["чачак" "а" "чачка" "чачака"]
                         ["писал" "" "писао" "писал"]
                         ["дал" "" "дао" "дал"]
                         ["селба" "" "сеоба" "селба"]
                         ["читалац" "" "читалац" "читаоц"]
                         ["тужилац" "" "тужилац" "тужиоц"]
                         ["глод" "јем" "глођем" "глодјем"]
                         ["трн" "је" "трње" "трнје"]
                         ["брз" "ји" "бржи" "брзји"]
                         ["сноп" "је" "снопље" "снопје"]
                         ["здрав" "је" "здравље" "здравје"]
                         ["рус" "ски" "руски" "русски"]
                         ["без" "звучни" "безвучни" "беззвучни"]
                         ["мест" "ни" "месни" "местни"]
                         ["изузет" "ци" "изузеци" "изузетци"]
                          ; почетак изузетака губљења сугласника
                         ["нај" "јачи" "најјачи" "најачи"]
                         ["нај" "једноставнији" "најједноставнији" "наједноставнији"]
                         ["над" "друштвени" "наддруштвени" "надруштвени"]
                         ["под" "дијалекат" "поддијалекат" "подијалекат"]
                         ["фашист" "киња" "фашисткиња" "фашискиња"]
                          ; крај изузетака губљења сугласника
                         ["друг" "ина" "дружина" "другина"]
                         ["јунак" "е" "јуначе" "јунаке"]
                         ["прах" "ина" "прашина" "прахина"]
                         ["прах" "ак" "прашак" "прахак"]
                          ; почетак изузетака палатализавије један под а
                         ["десанк" "ин" "десанкин" "десанчин"]
                         ["милк" "ин" "милкин" "милчин"]
                         ["олг" "ин" "олгин" "олжин"]
                         ["мех" "ин" "мехин" "мешин"]
                          ; крај изузетака палатализавије један под а
                         ["кнез" "е" "кнеже" "кнезе"]
                         ["милиц" "ин" "миличин" "милицин"]
                         ["мајк" "и" "мајци" "мајки"]
                         ["јаруг" "и" "јарузи" "јаруги"]
                         ["снах" "и" "снаси" "снахи"]
                          ; почетак изузетака палатализавије два
                         ["десанк" "и" "десанки" "десанци"]
                         ["милк" "и" "милки" "милци"]
                         ["олг" "и" "олги" "олжи"]
                         ["пожег" "и" "пожеги" ""]
                         ["пожег" "и" "пожези" ""]
                         ["лик" "и" "лики" ""]
                         ["лик" "и" "лици" ""]
                         ["сек" "и" "секи" "сеци"]
                         ["бак" "и" "баки" "баци"]
                          ; крај изузетака палатализавије два
                         ["паз" "ња" "пажња" "пазња"]
                         ["нос" "ња" "ношња" "носња"]
                         ["сналаз" "љив" "сналажљив" "сналазљив"]
                          ; почетак изузетака јспмт под а
                         ["из" "љубити" "изљубити" "ижљубити"]
                         ["раз" "љутити" "разљутити" "ражљутити"]
                          ; крај изузетака јспмт под а
                         ["одбран" "бени" "одбрамбени" "одбранбени"]
                         ["стан" "бени" "стамбени" "станбени"]
                          ; почетак изузетака јспмт под б
                         ["један" "пут" "једанпут" "једампут"]
                          ; крај изузетака јспмт под б
                         ["враб" "ца" "врапца" "врабца"]
                         ["срб" "ски" "српски" "србски"]
                         ["сват" "ба" "свадба" "сватба"]
                         ["рент" "ген" "рендген" "рентген"]
                          ; почетак изузетака јспз
                         ["пред" "седник" "председник" "претседник"]
                         ["пред" "школско" "предшколско" "претшколско"]
                         ["од" "суство" "одсуство" "отсуство"]
                         ["под" "шишати" "подшишати" "потшишати"]
                         ["Вашинг" "тон" "Вашингтон" "Вашинктон"]
                         ["Рент" "ген" "Рентген" "Рендген"]
                         ["драг" "стор" "драгстор" "дракстор"]
                         ["лонг" "плеј" "лонгплеј" "лонкплеј"]
                         ["нок" "даун" "нокдаун" "ногдаун"]
                         ["штајк" "брехер" "штрајкбрехер" "штрајгбрехер"]
                          ; крај изузетака јспз
                         ]]
    (doseq [[rec nastavak
             ispravno neispravno
             glasovna-promena-fn] testni-podaci]
     (is (= (glasovna-promena-fn rec nastavak)
            ispravno))
     (is (not (= (glasovna-promena-fn rec nastavak)
                 neispravno))
      ))
    ))
  )

