(ns srpski-jezik.padezi-test
  (:require [clojure.test :refer :all]
            [srpski-jezik.padezi :refer :all]))

(deftest test-transformisi-rec
  (testing
   (let [testni-podaci  [["борац" "а" "борца" "бораца"]
                         ["добар" "о" "добро" "добаро"]
                         ["један" "ог" "једног" "једаног"]
                         ["чачак" "а" "чачка" "чачака"]
                         ["писал" "" "писао" "писал"]
                         ["дал" "" "дао" "дал"]
                         ["селба" "a" "сеоба" "селба"]
                         ["читалац" "" "читалац" "читаоц"]
                         ["тужилац" "" "тужилац" "тужиоц"]
                         ["глод" "јем" "глођем" "глодјем"]
                         ["трн" "је" "трње" "трнје"]
                         ["брз" "ји" "бржи" "брзји"]
                         ["сноп" "је" "снопље" "снопје"]
                         ["здрав" "је" "здравље" "здравје"]
                         ["рус" "ски" "руски" "русски"]
                         ["без" "звучни" "безвучни" "беззвучни"]
                         ["мест" "ни" "месни" "местни"]
                         ["изузет" "ци" "изузеци" "изузетци"]
                          ; почетак изузетака губљења сугласника
                         ["нај" "јачи" "најјачи" "најачи"]
                         ["нај" "једноставнији" "најједноставнији" "наједноставнији"]
                         ["над" "друштвени" "наддруштвени" "надруштвени"]
                         ["под" "дијалекат" "поддијалекат" "подијалекат"]
                         ["фашист" "киња" "фашисткиња" "фашискиња"]
                          ; крај изузетака губљења сугласника
                         ["друг" "ина" "дружина" "другина"]
                         ["јунак" "е" "јуначе" "јунаке"]
                         ["прах" "ина" "прашина" "прахина"]
                         ["прах" "ак" "прашак" "прахак"]
                          ; почетак изузетака палатализавије један под а
                         ["десанк" "ин" "десанкин" "десанчин"]
                         ["милк" "ин" "милкин" "милчин"]
                         ["олг" "ин" "олгин" "олжин"]
                         ["мех" "ин" "мехин" "мешин"]
                          ; крај изузетака палатализавије један под а
                         ["кнез" "е" "кнеже" "кнезе"]
                         ["милиц" "ин" "миличин" "милицин"]
                         ["мајк" "и" "мајци" "мајки"]
                         ["јаруг" "и" "јарузи" "јаруги"]
                         ["снах" "и" "снаси" "снахи"]
                          ; почетак изузетака палатализавије два
                         ["десанк" "и" "десанки" "десанци"]
                         ["милк" "и" "милки" "милци"]
                         ["олг" "и" "олги" "олжи"]
                         ["пожег" "и" "пожеги" ""]
                         ["пожег" "и" "пожези" ""]
                         ["лик" "и" "лики" ""]
                         ["лик" "и" "лици" ""]
                         ["сек" "и" "секи" "сеци"]
                         ["бак" "и" "баки" "баци"]
                          ; крај изузетака палатализавије два
                         ["паз" "ња" "пажња" "пазња"]
                         ["нос" "ња" "ношња" "носња"]
                         ["сналаз" "љив" "сналажљив" "сналазљив"]
                          ; почетак изузетака јспмт под а
                         ["из" "љубити" "изљубити" "ижљубити"]
                         ["раз" "љутити" "разљутити" "ражљутити"]
                          ; крај изузетака јспмт под а
                         ["одбрана" "бени" "одбрамбени" "одбранбени"]
                         ["стан" "бени" "стамбени" "станбени"]
                          ; почетак изузетака јспмт под б
                         ["један" "пут" "једанпут" "једампут"]
                          ; крај изузетака јспмт под б
                         ["врабац" "а" "врапца" "врабца"]
                         ["срб" "ски" "српски" "србски"]
                         ["сват" "ба" "свадба" "сватба"]
                         ["рент" "ген" "рендген" "рентген"]
                          ; почетак изузетака јспз
                         ["пред" "седник" "председник" "претседник"]
                         ["пред" "школско" "предшколско" "претшколско"]
                         ["од" "суство" "одсуство" "отсуство"]
                         ["под" "шишати" "подшишати" "потшишати"]
                         ["Вашинг" "тон" "Вашингтон" "Вашинктон"]
                         ["Рент" "ген" "Рентген" "Рендген"]
                         ["драг" "стор" "драгстор" "дракстор"]
                         ["лонг" "плеј" "лонгплеј" "лонкплеј"]
                         ["нок" "даун" "нокдаун" "ногдаун"]
                         ["штајк" "брехер" "штрајкбрехер" "штрајгбрехер"]
                          ; крај изузетака јспз
                         ]]
    (doseq [[rec nastavak
             ispravno neispravno] testni-podaci]
     (let [transformisana-rec  (transformisi-rec rec nastavak)]
;      (println transformisana-rec "\n"
;               ispravno "\n"
;               neispravno "\n")
      (is (= transformisana-rec
             ispravno))
;      (is (not (= transformisana-rec
;                  neispravno))
;       )
       )
     ))
   ))

